Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEbu_regdef.h
/** \brief EBU Bus Configuration Register */
typedef struct _Ifx_EBU_BUS_RCON_Bits
{
    Ifx_Strict_32Bit FETBLEN:3;       /**< \brief [2:0] Burst Length for Synchronous Burst - FETBLEN (rw) */
    Ifx_Strict_32Bit FBBMSEL:1;       /**< \brief [3:3] Synchronous burst buffer mode select - FBBMSEL (rw) */
    Ifx_Strict_32Bit reserved_4:1;    /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit FDBKEN:1;        /**< \brief [5:5] Burst FLASH Clock Feedback Enable - FDBKEN (rw) */
    Ifx_Strict_32Bit BFCMSEL:1;       /**< \brief [6:6] Burst Flash Clock Mode Select - BFCMSEL (rw) */
    Ifx_Strict_32Bit NAA:1;           /**< \brief [7:7] Enable flash non-array access workaround - NAA (rw) */
    Ifx_Strict_32Bit reserved_8:8;    /**< \brief [15:8] \internal Reserved */
    Ifx_Strict_32Bit ECSE:1;          /**< \brief [16:16] Early Chip Select for Synchronous Burst - ECSE (rw) */
    Ifx_Strict_32Bit EBSE:1;          /**< \brief [17:17] Early Burst Signal Enable for Synchronous Burst - EBSE (rw) */
    Ifx_Strict_32Bit DBA:1;           /**< \brief [18:18] Disable Burst Address Wrapping - DBA (rw) */
    Ifx_Strict_32Bit WAITINV:1;       /**< \brief [19:19] Reversed polarity at WAIT - WAITINV (rw) */
    Ifx_Strict_32Bit BCGEN:2;         /**< \brief [21:20] Byte Control Signal Control - BCGEN (rw) */
    Ifx_Strict_32Bit PORTW:2;         /**< \brief [23:22] Device Addressing Mode - PORTW (rw) */
    Ifx_Strict_32Bit WAIT:2;          /**< \brief [25:24] External Wait Control - WAIT (rw) */
    Ifx_Strict_32Bit AAP:1;           /**< \brief [26:26] Asynchronous Address phase: - AAP (rw) */
    Ifx_Strict_32Bit LCKABRT:1;       /**< \brief [27:27] Lock Abort - LCKABRT (rwh) */
    Ifx_Strict_32Bit AGEN:4;          /**< \brief [31:28] Device Type for Region - AGEN (rw) */
} Ifx_EBU_BUS_RCON_Bits;

/** \brief EBU Bus Write Access Parameter Register */
typedef struct _Ifx_EBU_BUS_WAP_Bits
{
    Ifx_Strict_32Bit WRDTACS:4;       /**< \brief [3:0] Recovery Cycles between Different Regions - WRDTACS (rw) */
    Ifx_Strict_32Bit WRRECOVC:3;      /**< \brief [6:4] Recovery Cycles after Write Accesses - WRRECOVC (rw) */
    Ifx_Strict_32Bit WAITWRC:5;       /**< \brief [11:7] Programmed Wait States for write accesses - WAITWRC (rw) */
    Ifx_Strict_32Bit DATAC:4;         /**< \brief [15:12] Data Hold Cycles for Write Accesses - DATAC (rw) */
    Ifx_Strict_32Bit EXTCLOCK:2;      /**< \brief [17:16] Frequency of external clock at pin BFCLKO or SDCLKO - EXTCLOCK (rw) */
    Ifx_Strict_32Bit EXTDATA:2;       /**< \brief [19:18] Extended data - EXTDATA (rw) */
    Ifx_Strict_32Bit CMDDELAY:4;      /**< \brief [23:20] Command Delay Cycles - CMDDELAY (rw) */
    Ifx_Strict_32Bit AHOLDC:4;        /**< \brief [27:24] Address Hold Cycles - AHOLDC (rw) */
    Ifx_Strict_32Bit ADDRC:4;         /**< \brief [31:28] Address Cycles - ADDRC (rw) */
} Ifx_EBU_BUS_WAP_Bits;

/** \brief EBU Bus Write Configuration Register */
typedef struct _Ifx_EBU_BUS_WCON_Bits
{
    Ifx_Strict_32Bit FETBLEN:3;       /**< \brief [2:0] Burst Length for Synchronous Burst - FETBLEN (rw) */
    Ifx_Strict_32Bit FBBMSEL:1;       /**< \brief [3:3] Synchronous burst buffer mode select - FBBMSEL (rw) */
    Ifx_Strict_32Bit reserved_4:3;    /**< \brief [6:4] \internal Reserved */
    Ifx_Strict_32Bit NAA:1;           /**< \brief [7:7] Enable flash non-array access workaround - NAA (r) */
    Ifx_Strict_32Bit reserved_8:8;    /**< \brief [15:8] \internal Reserved */
    Ifx_Strict_32Bit ECSE:1;          /**< \brief [16:16] Early Chip Select for Synchronous Burst - ECSE (rw) */
    Ifx_Strict_32Bit EBSE:1;          /**< \brief [17:17] Early Burst Signal Enable for Synchronous Burst - EBSE (rw) */
    Ifx_Strict_32Bit reserved_18:1;    /**< \brief [18:18] \internal Reserved */
    Ifx_Strict_32Bit WAITINV:1;       /**< \brief [19:19] Reversed polarity at WAIT - WAITINV (rw) */
    Ifx_Strict_32Bit BCGEN:2;         /**< \brief [21:20] Byte Control Signal Control - BCGEN (rw) */
    Ifx_Strict_32Bit PORTW:2;         /**< \brief [23:22] Device Addressing Mode - PORTW (r) */
    Ifx_Strict_32Bit WAIT:2;          /**< \brief [25:24] External Wait Control - WAIT (rw) */
    Ifx_Strict_32Bit AAP:1;           /**< \brief [26:26] Asynchronous Address phase: - AAP (rw) */
    Ifx_Strict_32Bit LOCKCS:1;        /**< \brief [27:27] Lock Chip Select - LOCKCS (rw) */
    Ifx_Strict_32Bit AGEN:4;          /**< \brief [31:28] Device Type for Region - AGEN (rw) */
} Ifx_EBU_BUS_WCON_Bits;

/** \brief EBU Clock Control Register */
typedef struct _Ifx_EBU_CLC_Bits
{
    Ifx_Strict_32Bit DISR:1;          /**< \brief [0:0] EBU Disable Request Bit - DISR (rw) */
    Ifx_Strict_32Bit DISS:1;          /**< \brief [1:1] EBU Disable Status Bit - DISS (r) */
    Ifx_Strict_32Bit reserved_2:6;    /**< \brief [7:2] \internal Reserved */
    Ifx_Strict_32Bit EPE:1;           /**< \brief [8:8] Endinit Protection Enable - EPE (rw) */
    Ifx_Strict_32Bit reserved_9:7;    /**< \brief [15:9] \internal Reserved */
    Ifx_Strict_32Bit SYNC:1;          /**< \brief [16:16] EBU Clocking Mode - SYNC (rw) */
    Ifx_Strict_32Bit DIV2:1;          /**< \brief [17:17] DIV2 Clocking Mode - DIV2 (rw) */
    Ifx_Strict_32Bit EBUDIV:2;        /**< \brief [19:18] EBU Clock Divide Ratio - EBUDIV (rw) */
    Ifx_Strict_32Bit SYNCACK:1;       /**< \brief [20:20] EBU Clocking Mode Status - SYNCACK (r) */
    Ifx_Strict_32Bit DIV2ACK:1;       /**< \brief [21:21] DIV2 Clocking Mode Status - DIV2ACK (r) */
    Ifx_Strict_32Bit EBUDIVACK:2;     /**< \brief [23:22] EBU Clock Divide Ratio Status - EBUDIVACK (r) */
    Ifx_Strict_32Bit reserved_24:8;    /**< \brief [31:24] \internal Reserved */
} Ifx_EBU_CLC_Bits;

/** \brief EBU External Boot Configuration Register */
typedef struct _Ifx_EBU_EXTBOOT_Bits
{
    Ifx_Strict_32Bit CFGEND:1;        /**< \brief [0:0] Configuration End - CFGEND (rh) */
    Ifx_Strict_32Bit CFGERR:1;        /**< \brief [1:1] Configuration Fetch Error - CFGERR (rh) */
    Ifx_Strict_32Bit reserved_2:29;    /**< \brief [30:2] \internal Reserved */
    Ifx_Strict_32Bit EBUCFG:1;        /**< \brief [31:31] Configuration Word Fetch - EBUCFG (w) */
} Ifx_EBU_EXTBOOT_Bits;

